In [1]:
import findspark
findspark.init("/opt/manual/spark")
from pyspark.sql import SparkSession
from pyspark.sql.types import *
from pyspark.sql import functions as F

In [2]:
spark = SparkSession \
.builder \
.master("local[2]") \
.appName("Homework4_1") \
.config("spark.executer.memory","2g") \
.config("spark.driver.memory","1g") \
.enableHiveSupport() \
.getOrCreate()

WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.apache.spark.unsafe.Platform (file:/opt/manual/spark-3.1.1-bin-hadoop3.2/jars/spark-unsafe_2.12-3.1.1.jar) to constructor java.nio.DirectByteBuffer(long,int)
WARNING: Please consider reporting this to the maintainers of org.apache.spark.unsafe.Platform
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
2023-04-05 16:17:34,780 WARN util.NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

In [ ]:
# Check the dataset
'''
[train@trainvm ~]$ ls -l ~/datasets/
'''

# We have disticnt six csv file

In [3]:
data_path = "file:///home/train/datasets/retail_db"

In [24]:
categories = spark.read.option("inferSchema",True).csv(data_path+"/categories.csv", header=True)
categories.show(10)

+----------+--------------------+-------------------+
|categoryId|categoryDepartmentId|       categoryName|
+----------+--------------------+-------------------+
|         1|                   2|           Football|
|         2|                   2|             Soccer|
|         3|                   2|Baseball & Softball|
|         4|                   2|         Basketball|
|         5|                   2|           Lacrosse|
|         6|                   2|   Tennis & Racquet|
|         7|                   2|             Hockey|
|         8|                   2|        More Sports|
|         9|                   3|   Cardio Equipment|
|        10|                   3|  Strength Training|
+----------+--------------------+-------------------+
only showing top 10 rows

In [5]:
categories.printSchema()

root
 |-- categoryId: integer (nullable = true)
 |-- categoryDepartmentId: integer (nullable = true)
 |-- categoryName: string (nullable = true)

In [10]:
customers = spark.read.option("inferSchema",True).csv(data_path+"/customers.csv", header=True)
customers.limit(3).toPandas()

,customerId,customerFName,customerLName,customerEmail,customerPassword,customerStreet,customerCity,customerState,customerZipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725

In [11]:
customers.printSchema()

root
 |-- customerId: integer (nullable = true)
 |-- customerFName: string (nullable = true)
 |-- customerLName: string (nullable = true)
 |-- customerEmail: string (nullable = true)
 |-- customerPassword: string (nullable = true)
 |-- customerStreet: string (nullable = true)
 |-- customerCity: string (nullable = true)
 |-- customerState: string (nullable = true)
 |-- customerZipcode: integer (nullable = true)

In [6]:
departments = spark.read.option("inferSchema",True).csv(data_path+"/departments.csv", header=True)
departments.show(3)

+------------+--------------+
|departmentId|departmentName|
+------------+--------------+
|           2|       Fitness|
|           3|      Footwear|
|           4|       Apparel|
+------------+--------------+
only showing top 3 rows

In [12]:
departments.printSchema()

root
 |-- departmentId: integer (nullable = true)
 |-- departmentName: string (nullable = true)

In [8]:
products = spark.read.option("inferSchema",True).csv(data_path+"/products.csv", header=True)
products.show(3)

+---------+-----------------+--------------------+------------------+------------+--------------------+
|productId|productCategoryId|         productName|productDescription|productPrice|        productImage|
+---------+-----------------+--------------------+------------------+------------+--------------------+
|        1|                2|Quest Q64 10 FT. ...|              null|       59.98|http://images.acm...|
|        2|                2|Under Armour Men'...|              null|      129.99|http://images.acm...|
|        3|                2|Under Armour Men'...|              null|       89.99|http://images.acm...|
+---------+-----------------+--------------------+------------------+------------+--------------------+
only showing top 3 rows

In [9]:
products.printSchema()

root
 |-- productId: integer (nullable = true)
 |-- productCategoryId: integer (nullable = true)
 |-- productName: string (nullable = true)
 |-- productDescription: string (nullable = true)
 |-- productPrice: double (nullable = true)
 |-- productImage: string (nullable = true)

In [13]:
orders = spark.read.option("inferSchema",True).csv(data_path+"/orders.csv", header=True)
orders.show(3)

+-------+--------------------+---------------+---------------+
|orderId|           orderDate|orderCustomerId|    orderStatus|
+-------+--------------------+---------------+---------------+
|      1|2013-07-25 00:00:...|          11599|         CLOSED|
|      2|2013-07-25 00:00:...|            256|PENDING_PAYMENT|
|      3|2013-07-25 00:00:...|          12111|       COMPLETE|
+-------+--------------------+---------------+---------------+
only showing top 3 rows

In [14]:
orders.printSchema()

root
 |-- orderId: integer (nullable = true)
 |-- orderDate: string (nullable = true)
 |-- orderCustomerId: integer (nullable = true)
 |-- orderStatus: string (nullable = true)

In [15]:
order_items = spark.read.option("inferSchema",True).csv(data_path+"/order_items.csv", header=True)
order_items.show(3)

+-------------+----------------+------------------+-----------------+-----------------+---------------------+
|orderItemName|orderItemOrderId|orderItemProductId|orderItemQuantity|orderItemSubTotal|orderItemProductPrice|
+-------------+----------------+------------------+-----------------+-----------------+---------------------+
|            1|               1|               957|                1|           299.98|               299.98|
|            2|               2|              1073|                1|           199.99|               199.99|
|            3|               2|               502|                5|            250.0|                 50.0|
+-------------+----------------+------------------+-----------------+-----------------+---------------------+
only showing top 3 rows

In [16]:
order_items.printSchema()

root
 |-- orderItemName: integer (nullable = true)
 |-- orderItemOrderId: integer (nullable = true)
 |-- orderItemProductId: integer (nullable = true)
 |-- orderItemQuantity: integer (nullable = true)
 |-- orderItemSubTotal: double (nullable = true)
 |-- orderItemProductPrice: double (nullable = true)

In [17]:
# Q1.

# Find how many unique orderItemOrderIds are in the order_items table?

In [18]:
order_items.select("orderItemOrderId").distinct().count()

57431

In [19]:
# Q2.

# Find how many rows are in the orders and order_items tables?

In [20]:
orders.count()

68883

In [23]:
order_items.count()

172198

In [22]:
# Q3.

# Write the most canceled (descending order) products to the local disk in parquet format in terms of total sales amount.

In [25]:
# Step 1. We need the "products" data to see which products. ------------------------------->"products"
#         We need to use categories data to see which catagories---------------------------->"catagories"

# Step 2. We need to know order information. So I will use "order_items" data.-------------->"order_items"

# Step 3. We will join steps1 and steps2 and achieve "Cancelled Products".

In [26]:
cat_products = products.join(categories, products['productCategoryId'] == categories['categoryId']) \
                       .select("productId","productName", "categoryName")

cat_products.limit(5).toPandas().head()

   productId                                    productName categoryName
0          1  Quest Q64 10 FT. x 10 FT. Slant Leg Instant U       Soccer
1          2  Under Armour Men's Highlight MC Football Clea       Soccer
2          3  Under Armour Men's Renegade D Mid Football Cl       Soccer
3          4  Under Armour Men's Renegade D Mid Football Cl       Soccer
4          5  Riddell Youth Revolution Speed Custom Footbal       Soccer

In [27]:
orders_and_items = order_items.join(orders, order_items['orderItemOrderId'] == orders['orderId']) \
                              .select("orderId","orderItemProductId","orderItemSubTotal","orderStatus")

orders_and_items.limit(5).toPandas().head()

   orderId  orderItemProductId  orderItemSubTotal      orderStatus
0        1                 957             299.98           CLOSED
1        2                1073             199.99  PENDING_PAYMENT
2        2                 502             250.00  PENDING_PAYMENT
3        2                 403             129.99  PENDING_PAYMENT
4        4                 897              49.98           CLOSED

In [28]:
cancelled_table = orders_and_items.join(cat_products, orders_and_items['orderItemProductId'] == cat_products['productId'])

cancelled_table.limit(25).toPandas().head(25)

,orderId,orderItemProductId,orderItemSubTotal,orderStatus,productId,productName,categoryName
0,57760,858,199.99,PENDING_PAYMENT,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
1,57847,858,199.99,COMPLETE,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
2,58071,858,199.99,PENDING,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
3,58170,858,199.99,PENDING,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
4,58585,858,199.99,CANCELED,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
5,58589,858,199.99,COMPLETE,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
6,58695,858,199.99,COMPLETE,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
7,58774,858,199.99,PENDING,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
8,58797,858,199.99,COMPLETE,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
9,58926,858,199.99,PENDING_PAYMENT,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
10,59169,858,199.99,PROCESSING,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
11,59273,858,199.99,PROCESSING,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
12,59542,858,199.99,PENDING,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
13,59893,858,199.99,PENDING_PAYMENT,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
14,60113,858,199.99,COMPLETE,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
15,60276,858,199.99,COMPLETE,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
16,60373,858,199.99,PENDING_PAYMENT,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
17,60616,858,199.99,COMPLETE,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
18,60716,858,199.99,PENDING_PAYMENT,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
19,61231,858,199.99,PROCESSING,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
20,61437,858,199.99,CLOSED,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
21,61562,858,199.99,PROCESSING,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
22,61963,858,199.99,PENDING_PAYMENT,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
23,62122,858,199.99,COMPLETE,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs
24,62252,858,199.99,PROCESSING,858,GolfBuddy VT3 GPS Watch,Kids' Golf Clubs

In [30]:
most_cancelled_products = cancelled_table.filter("orderStatus == 'CANCELED'") \
                                         .groupBy("productName").agg(F.sum("orderItemSubTotal").alias("Totalprice")) \
                                         .orderBy(F.desc("TotalPrice"))

most_cancelled_products.limit(10).toPandas().head(10)

                                     productName  Totalprice
0      Field & Stream Sportsman 16 Gun Fire Safe   134393.28
1               Perfect Fitness Perfect Rip Deck    85785.70
2              Nike Men's Free 5.0+ Running Shoe    80691.93
3  Diamondback Women's Serene Classic Comfort Bi    80094.66
4                    Pelican Sunstream 100 Kayak    66196.69
5           Nike Men's Dri-FIT Victory Golf Polo    65750.00
6        Nike Men's CJ Elite 2 TD Football Cleat    60705.33
7               O'Brien Men's Neoprene Life Vest    58126.74
8  Under Armour Girls' Toddler Spine Surge Runni    26153.46
9       LIJA Women's Eyelet Sleeveless Golf Polo     2145.00

In [65]:
output_path = "file:///home/train/pyspark_output_data"

In [66]:
spark.read.parquet(output_path+"/most_cancelled_products_parquet") \
.limit(10).toPandas().head(10)

                                     productName  Totalprice
0      Field & Stream Sportsman 16 Gun Fire Safe   134393.28
1               Perfect Fitness Perfect Rip Deck    85785.70
2              Nike Men's Free 5.0+ Running Shoe    80691.93
3  Diamondback Women's Serene Classic Comfort Bi    80094.66
4                    Pelican Sunstream 100 Kayak    66196.69
5           Nike Men's Dri-FIT Victory Golf Polo    65750.00
6        Nike Men's CJ Elite 2 TD Football Cleat    60705.33
7               O'Brien Men's Neoprene Life Vest    58126.74
8  Under Armour Girls' Toddler Spine Surge Runni    26153.46
9       LIJA Women's Eyelet Sleeveless Golf Polo     2145.00

In [31]:
# Q4. 

# In which month of which year (in Turkish) was the highest total sales?

In [ ]:
# Step 1. I will join date of order_items and orders.

# Step 2. I will replace date format.

In [32]:
orders_and_items_date = order_items.join(orders, order_items['orderItemOrderId'] == orders['orderId']) \
                                   .select("orderId","orderItemProductId","orderItemSubTotal","orderStatus","orderDate")

orders_and_items_date.limit(5).toPandas().head()

,orderId,orderItemProductId,orderItemSubTotal,orderStatus,orderDate
0,1,957,299.98,CLOSED,2013-07-25 00:00:00.0
1,2,1073,199.99,PENDING_PAYMENT,2013-07-25 00:00:00.0
2,2,502,250.00,PENDING_PAYMENT,2013-07-25 00:00:00.0
3,2,403,129.99,PENDING_PAYMENT,2013-07-25 00:00:00.0
4,4,897,49.98,CLOSED,2013-07-25 00:00:00.0

In [35]:
df_year_and_month = orders_and_items_date.withColumn("orderDate", 
                                        F.to_timestamp(F.col("orderDate"), "yyyy-MM-dd HH:mm:ss.S")) \
                                         .withColumn("Year", F.year(F.col("orderDate"))) \
                                         .withColumn("Month", F.month(F.col("orderDate")))

df_year_and_month.limit(5).toPandas()

,orderId,orderItemProductId,orderItemSubTotal,orderStatus,orderDate,Year,Month
0,1,957,299.98,CLOSED,2013-07-25,2013,7
1,2,1073,199.99,PENDING_PAYMENT,2013-07-25,2013,7
2,2,502,250.00,PENDING_PAYMENT,2013-07-25,2013,7
3,2,403,129.99,PENDING_PAYMENT,2013-07-25,2013,7
4,4,897,49.98,CLOSED,2013-07-25,2013,7

In [67]:
df_year_and_month.filter("orderStatus not in ('CANCELED')") \
                 .groupBy('Year','Month').agg(F.sum("orderItemSubTotal").alias("Sum_SubTotal")) \
                 .orderBy(F.desc("Sum_SubTotal")) \
                 .limit(10).toPandas()

   Year  Month  Sum_SubTotal
0  2013     11    3105843.27
1  2014      1    2870834.18
2  2013     12    2869997.88
3  2013      9    2866553.33
4  2014      3    2805006.32
5  2013      8    2769236.03
6  2014      4    2758912.47
7  2014      2    2712838.58
8  2014      5    2695699.48
9  2014      6    2657013.04

In [68]:
df_year_and_month.filter("orderStatus not in ('CANCELED')") \
                 .groupBy('Year','Month').agg(F.sum("orderItemSubTotal").alias("Sum_SubTotal")) \
                 .orderBy(F.desc("Sum_SubTotal")) \
                 .limit(10).toPandas()

   Year  Month  Sum_SubTotal
0  2013     11    3105843.27
1  2014      1    2870834.18
2  2013     12    2869997.88
3  2013      9    2866553.33
4  2014      3    2805006.32
5  2013      8    2769236.03
6  2014      4    2758912.47
7  2014      2    2712838.58
8  2014      5    2695699.48
9  2014      6    2657013.04

In [69]:
def month_to_tr(input_month):
    month_converter = {
        1: "Ocak",
        2: "ubat",
        3: "Mart",
        4: "Nisan",
        5: "Mays",
        6: "Haziran",
        7: "Temmuz",
        8: "Austos",
        9: "Eyll",
        10: "Ekim",
        11: "Kasm",
        12: "Aralk"
    }
    
    return month_converter.get(input_month)

In [50]:
month_to_tr(7)

'Temmuz'

In [40]:
month_to_tr_udf = spark.udf.register("month_to_tr_udf", month_to_tr, StringType())

In [70]:
df_year_and_month.filter("orderStatus not in ('CANCELED')") \
                 .groupBy('Year','Month').agg(F.sum("orderItemSubTotal").alias("Sum_SubTotal")) \
                 .orderBy(F.desc("Sum_SubTotal")) \
                 .withColumn("Month_TR", month_to_tr_udf(F.col("Month"))) \
                 .limit(10).toPandas()

   Year  Month  Sum_SubTotal Month_TR
0  2013     11    3105843.27    Kasm
1  2014      1    2870834.18     Ocak
2  2013     12    2869997.88   Aralk
3  2013      9    2866553.33    Eyll
4  2014      3    2805006.32     Mart
5  2013      8    2769236.03  Austos
6  2014      4    2758912.47    Nisan
7  2014      2    2712838.58    ubat
8  2014      5    2695699.48    Mays
9  2014      6    2657013.04  Haziran

In [42]:
# Q6 

# On which day of the week (in Turkish) was the highest total sales?

In [43]:
df_day_of_week = orders_and_items_date.withColumn("orderDate", 
                                     F.to_timestamp(F.col("orderDate"), "yyyy-MM-dd HH:mm:ss.S")) \
                                      .withColumn("Day", F.dayofweek(F.col("orderDate")))

df_day_of_week.limit(5).toPandas()

,orderId,orderItemProductId,orderItemSubTotal,orderStatus,orderDate,Day
0,1,957,299.98,CLOSED,2013-07-25,5
1,2,1073,199.99,PENDING_PAYMENT,2013-07-25,5
2,2,502,250.00,PENDING_PAYMENT,2013-07-25,5
3,2,403,129.99,PENDING_PAYMENT,2013-07-25,5
4,4,897,49.98,CLOSED,2013-07-25,5

In [44]:
df_day_of_week.filter("orderStatus not in ('CANCELED')") \
              .groupBy('Day').agg(F.sum("orderItemSubTotal").alias("Sum_SubTotal")) \
              .orderBy(F.desc("Sum_SubTotal")) \
              .limit(10).toPandas()

   Day  Sum_SubTotal
0    6  5.065099e+06
1    5  4.878165e+06
2    7  4.862228e+06
3    3  4.809500e+06
4    4  4.805157e+06
5    1  4.750555e+06
6    2  4.455886e+06

In [45]:
# convert day to TR with udf
def day_to_tr(input_day):
    day_converter = {
        1: "Pazartesi",
        2: "Sal",
        3: "aramba",
        4: "Perembe",
        5: "Cuma",
        6: "Cumartesi",
        7: "Pazar"
    }
    
    return day_converter.get(input_day)

In [51]:
day_to_tr(7)

'Pazar'

In [48]:
day_to_tr_udf = spark.udf.register("day_to_tr_udf", day_to_tr, StringType())

2023-04-05 21:24:24,256 WARN analysis.SimpleFunctionRegistry: The function day_to_tr_udf replaced a previously registered function.

In [49]:
df_day_of_week.filter("orderStatus not in ('CANCELED')") \
              .groupBy('Day').agg(F.sum("orderItemSubTotal").alias("Sum_SubTotal")) \
              .orderBy(F.desc("Sum_SubTotal")) \
              .withColumn("Day_TR", day_to_tr_udf(F.col("Day"))) \
              .limit(10).toPandas()

   Day  Sum_SubTotal     Day_TR
0    6  5.065099e+06  Cumartesi
1    5  4.878165e+06       Cuma
2    7  4.862228e+06      Pazar
3    3  4.809500e+06   aramba
4    4  4.805157e+06   Perembe
5    1  4.750555e+06  Pazartesi
6    2  4.455886e+06       Sal

In [52]:
# Q7.Create the largest possible table from all these tables and write it in a table called retail_all in the hive test1 database.

In [ ]:
# Step1 We will join categories and departments table

# Step2 We will join order and orders_items table 

# Step3 We will join resolt of step1 and step2

In [53]:
! ls /home/train/datasets/retail_db/

categories.csv	departments.csv  orders.csv
customers.csv	order_items.csv  products.csv

In [54]:
cat_dep_prod = products.join(categories, products.productCategoryId == categories.categoryId, "left") \
                       .join(departments, categories.categoryDepartmentId == departments.departmentId, "left")


cat_dep_prod.limit(1).toPandas()

,productId,productCategoryId,productName,productDescription,productPrice,productImage,categoryId,categoryDepartmentId,categoryName,departmentId,departmentName
0,1,2,Quest Q64 10 FT. x 10 FT. Slant Leg Instant U,None,59.98,http://images.acmesports.sports/Quest+Q64+10+F...,2,2,Soccer,2,Fitness

In [55]:
cat_dep_prod.count()

1345

In [61]:
orders_and_items_cust = order_items.join(orders, order_items['orderItemOrderId'] == orders['orderId']) \
                                   .join(customers, orders.orderCustomerId == customers.customerId)
 
orders_and_items_cust.limit(1).toPandas()

,orderItemName,orderItemOrderId,orderItemProductId,orderItemQuantity,orderItemSubTotal,orderItemProductPrice,orderId,orderDate,orderCustomerId,orderStatus,customerId,customerFName,customerLName,customerEmail,customerPassword,customerStreet,customerCity,customerState,customerZipcode
0,1,1,957,1,299.98,299.98,1,2013-07-25 00:00:00.0,11599,CLOSED,11599,Mary,Malone,XXXXXXXXX,XXXXXXXXX,8708 Indian Horse Highway,Hickory,NC,28601

In [62]:
orders_and_items_cust.count()

172198

In [63]:
all_in_one = orders_and_items_cust.join(cat_dep_prod, orders_and_items_cust.orderItemProductId == cat_dep_prod.productId)

all_in_one.limit(2).toPandas()

,orderItemName,orderItemOrderId,orderItemProductId,orderItemQuantity,orderItemSubTotal,orderItemProductPrice,orderId,orderDate,orderCustomerId,orderStatus,...,productCategoryId,productName,productDescription,productPrice,productImage,categoryId,categoryDepartmentId,categoryName,departmentId,departmentName
0,144513,57760,858,1,199.99,199.99,57760,2013-07-25 00:00:00.0,8330,PENDING_PAYMENT,...,38,GolfBuddy VT3 GPS Watch,None,199.99,http://images.acmesports.sports/GolfBuddy+VT3+...,38,6,Kids' Golf Clubs,6,Outdoors
1,144738,57847,858,1,199.99,199.99,57847,2013-07-28 00:00:00.0,9548,COMPLETE,...,38,GolfBuddy VT3 GPS Watch,None,199.99,http://images.acmesports.sports/GolfBuddy+VT3+...,38,6,Kids' Golf Clubs,6,Outdoors

In [60]:
all_in_one.count()

172198

In [64]:
all_in_one.write.format("orc") \
.mode("overwrite") \
.saveAsTable("test1.retail_all")

2023-04-05 21:49:33,959 WARN conf.HiveConf: HiveConf of name hive.stats.jdbc.timeout does not exist
2023-04-05 21:49:33,960 WARN conf.HiveConf: HiveConf of name hive.stats.retries.wait does not exist
2023-04-05 21:49:36,674 WARN util.package: Truncated the string representation of a plan since it was too large. This behavior can be adjusted by setting 'spark.sql.debug.maxToStringFields'.
2023-04-05 21:50:05,058 WARN session.SessionState: METASTORE_FILTER_HOOK will be ignored, since hive.security.authorization.manager is set to instance of HiveAuthorizerFactory.
2023-04-05 21:50:05,117 WARN conf.HiveConf: HiveConf of name hive.internal.ss.authz.settings.applied.marker does not exist
2023-04-05 21:50:05,117 WARN conf.HiveConf: HiveConf of name hive.stats.jdbc.timeout does not exist
2023-04-05 21:50:05,117 WARN conf.HiveConf: HiveConf of name hive.stats.retries.wait does not exist
2023-04-05 21:50:05,551 WARN metastore.ObjectStore: Failed to get database global_temp, returning NoSuchObjectException